# SomeElementsNotCopiedWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..SomeElementsNotCopiedWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Some elements were not copied.[Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SomeElementsNotCopiedWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SomeElementsNotCopiedWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SomeElementsNotCopiedWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace